{"id": 0, "url": "https://www.chinadaily.com.cn/a/202204/08/WS624fb321a310fd2b29e55d21.html", "title": "Wang Shuang misses Chinese women's league season opener due to injury", "content": "BEIJING - Chinese striker Wang Shuang sat out Thursday's Chinese women's football Super League season opener between Wuhan Chegu Jianghan University and Shaanxi Chang'an Athletic FC due to an ankle injury.\nThough without their playmaker Wang, the Wuhan side, which won the league title last season, proved much stronger than the newly-promoted Shaanxi team and won by 3-0.\nWang picked up the injury when she twisted her right ankle in China's Asian Cup semifinal win over Japan in early February.\nShe played in the final against South Korea, and was replaced in the second half."}
{"id": 1, "url": "https://www.chinadaily.com.cn/a/202202/28/WS621c5acfa310cdd39bc89496.html", "title": "Liverpool win record ninth League Cup", "content": "LONDON -- Liverpool won a record ninth League Cup in dramatic fashion, as Chelsea goalkeeper Kepa Arrizabalaga missed the decisive penalty to give Liverpool an 11-10 shootout victory in Sunday's final.\nThe game ended goalless after 120 minutes which saw plenty of chances, some great saves from both keepers and three goals (one for Liverpool and two for Chelsea) ruled out for offside.\nIt was cruel on Kepa, who was sent on at the end of extra-time to replace Edouard Mendy given his reputation as a penalty-saving specialist, but the Spaniard was unable to repel any of Liverpool's kicks before missing the decisive penalty himself.\nLiverpool remain in contention for an unprecedented quadruple after closing the gap on Premier League leaders Manchester City to six points with a game in hand."}
{"id": 2, "url": "https://www.chinadaily.com.cn/a/202203/01/WS621d7bf9a310cdd39bc89799.html", "title": "Napoli keeps heat on Milan", "content": "Departing Napoli forward Lorenzo Insigne scored one goal and set up a stoppage-time winner to help his side beat Lazio 2-1 and move level on points with AC Milan at the top of Serie A on Sunday ahead of their eagerly anticipated clash this weekend.\nJust as it seemed as though Pedro's late equalizer would prevent Napoli from moving top, Fabian Ruiz combined with Insigne to score the winner in the fourth minute of stoppage time. All the players, including those on the bench and the staff, ran to celebrate in front of the visiting supporters.\nInsigne, who is leaving Napoli at the end of the season after 15 years to join Toronto FC in Major League Soccer, had scored the opener in the 62nd minute. He also had another goal ruled out for offside.\nNapoli moved above Milan on goal difference. Head-to-head is the first tiebreaker if sides are level on points at the end of the season. Napoli won 1-0 when the two sides met in December.\nNapoli was without a win in its previous four matches and coach Luciano Spalletti hit back at the team's critics after the victory.\n\"I would like to underline the fact that everyone was stupidly critical about this team, saying we didn't have character. They even said that this week. It's exactly the opposite,\" Spalletti said.\n\"In general there's an ugly atmosphere around Napoli, people saying that the players are soft but instead they have character. I want to see what they say now… we are fighting at the top of the table.\""}
{"id": 3, "url": "https://www.chinadaily.com.cn/a/202111/28/WS61a2e052a310cdd39bc77eed.html", "title": "Liverpool cruise past Southampton in English Premier League", "content": "LONDON -- Liverpool kept the pressure on leaders Chelsea in the English Premier League with a 4-0 win against Southampton at home on Saturday.\nDiogo Jota scored twice for Jurgen Klopp's side in the 32nd and 97th minute apiece. Thiago Alcantara and Virgil van Djik also found the net for the home team.\nThe Reds now sit one point behind Chelsea, who host Manchester United on Sunday.\nSteven Gerrard's winning start in the Premier League continued as Aston Villa won 2-1 away to Crystal Palace to make it two wins from two games since he joined from Glasgow Rangers.\nMatt Targett put Villa ahead in the 15th minute following a corner and John McGinn's first time shot five minutes from time assured the win even though Marc Guehi scored a late consolation goal for the home side.\nArsenal returned to winning ways after last weekend's 4-0 defeat to Liverpool with a 2-0 win at home to Newcastle United leaving the visitors without a win in their first 13 games of the season.\nNewcastle coach Eddie Howe was able to sit in the dugout for the first time after recovering from the COVID-19 and saw how second half goals from Bakary Saka and Gabriel Martinelli condemned his side to defeat.\nMeanwhile, Norwich City picked up another point to extend their unbeaten run to three games with a 0-0 draw at home to Wolves. Norwich will be disappointed to not pick up all three points after Wolves keeper Jose Sa denied both Teemu Pukki and Lukas Rupp with late saves.\nIn Saturday's last game, Brighton and Leeds United drew 0-0 in a result that extended Brighton's winless run to eight games. Brighton had most of the chances, but familiar failings in front of goal cost them the chance of a win."}